app/controllers/forms_controller.rb

SELECT "forms".* FROM "forms"
---
  def index
    @forms = Form.all

SELECT  "forms".* FROM "forms"  WHERE "forms"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_form
      @form = Form.find(params[:id])